
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УправлениеВидимостьЭлементов();
КонецПроцедуры








#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	УправлениеВидимостьЭлементов();
КонецПроцедуры
&НаСервере
Процедура УправлениеВидимостьЭлементов()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ГруппаПравая.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти



