#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ДобавитьКнопкуЗаполнить(Форма);  
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ДобавитьКнопкуЗаполнить(Форма)

	КнопкаКоманда = Форма.Команды.Добавить("ВКМ_Заполнить");
	КнопкаКоманда.Заголовок = "Заполнить";
	КнопкаКоманда.Действие = "ВКМ_Заполнить";
		
	КнопкаЭлемент = Форма.Элементы.Добавить("ВКМ_Заполнить", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	КнопкаЭлемент.ИмяКоманды = "ВКМ_Заполнить";
	
КонецПроцедуры


#КонецОбласти
