
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаСотрудников = ПолучитьИзВременногоХранилища(Параметры.Объект);
	Год = ПолучитьИзВременногоХранилища(Параметры.Год);
	
	ВКМ_ДиаграммаГанта.Обновление = Ложь;
	ВКМ_ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ВКМ_ДиаграммаГанта.Очистить();
	
	ВКМ_ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(Год), КонецГода(Год));
	Серия = ВКМ_ДиаграммаГанта.УстановитьСерию("Отпуска");
		
	Для Каждого Сотрудник Из ТаблицаСотрудников Цикл 
		
		Точка = ВКМ_ДиаграммаГанта.УстановитьТочку(Сотрудник.ВКМ_Сотрудник);
		Точка.Картинка = БиблиотекаКартинок.СостояниеПользователя02;
		Значение = ВКМ_ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.ВКМ_ДнейОтпуска = Значение.Данные.ВКМ_ДнейОтпуска + Сотрудник.ВКМ_ЧислоДнейОтпуска;
		Если Сотрудник.ВКМ_ЧислоДнейОтпуска > 28 Тогда 
			Значение.ЦветФона = WebЦвета.АкварельноСиний;
		КонецЕсли;
				
		Интервал = Значение.Добавить();
		Интервал.Начало = Сотрудник.ВКМ_ДатаНачала;
		Интервал.Конец = Сотрудник.ВКМ_ДатаОкончания;
		
	КонецЦикла;
	
	Шкала = ВКМ_ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала.Метки.Очистить();
	МеткиВремени = Шкала.Метки.Добавить(НачалоДня(ТекущаяДата())); 
	МеткиВремени.Текст = "Текущая дата " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	МеткиВремени.ЦветТекста = WebЦвета.КрасноФиолетовый;
	МеткиВремени.ЦветЛинии = WebЦвета.КрасноФиолетовый; 
	
	ВКМ_ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры
