
Функция PingGETPing(Запрос)
	Возврат ВКМ_ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
КонецФункции

Функция SendPOSTSend(Запрос)
	УстановитьПривилегированныйРежим(Истина);
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Попытка                                
		Ответ = ВКМ_Телеграм.ОбработатьВходящийЗапрос(Запрос);
	Исключение  
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ВКМ_ОбщегоНазначенияHTTP.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("bots.send", НачалоЗамера);
	
	ВКМ_ОбщегоНазначенияHTTP.ЗаписьЛога("send", Запрос, Ответ);
	
	Возврат Ответ;
КонецФункции
