
#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_ОтпускаСотрудников Из ВКМ_ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник;
		Движение.ВКМ_ДатаНачала = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала;
		Движение.ВКМ_ДатаОкончания = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания;
		Движение.ВКМ_ЧислоДнейОтпуска = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ЧислоДнейОтпуска;
	КонецЦикла; 
	
	
КонецПроцедуры


#КонецОбласти
