#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
Функция  СоздатьДокументыРеализацииНаСервере(Период) Экспорт 
	
	МассивРеализацийИДоговоров = ВКМ_ПолучитьРеализацииИДоговоры(Период);
	
	МассивТЧ = Новый Массив;
	
	Для Каждого СтрокаМассива Из МассивРеализацийИДоговоров Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаМассива.РеализацияТоваровУслуг) Тогда 
			
			МассивТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаМассива.Договор, ВКМ_СоздатьНовыйДокументРеализации(СтрокаМассива)));
			Продолжить;
			
		КонецЕсли;
		
		МассивТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаМассива.Договор, СтрокаМассива.РеализацияТоваровУслуг));
		
	КонецЦикла;
	
	Возврат МассивТЧ;
	
КонецФункции

Функция  ВКМ_ПолучитьРеализацииИДоговоры(Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договоры
	               |ПОМЕСТИТЬ ВТ_Договоры
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	               |	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Реализация
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	               |	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	               |	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Договоры.Договоры.Ссылка КАК Договор,
	               |	ВТ_Реализация.Ссылка КАК РеализацияТоваровУслуг
	               |ИЗ
	               |	ВТ_Договоры КАК ВТ_Договоры
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	               |		ПО ВТ_Договоры.Договоры.Ссылка = ВТ_Реализация.Ссылка.Договор.Ссылка";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ВКМ_СоздатьНовыйДокументРеализации(СтрокаМассива)

	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Организация = СтрокаМассива.Договор.Организация;
	НовыйДокумент.Контрагент = СтрокаМассива.Договор.Владелец;
	НовыйДокумент.Договор = СтрокаМассива.Договор;
	НовыйДокумент.Дата = ТекущаяДата(); 
	НовыйДокумент.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	НовыйДокумент.Комментарий = "Документ создан автоматически.";
	НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДокумент.Ссылка;

КонецФункции

Процедура ЗаполнитьТЧ(Договор, Реализация, ТЧ) Экспорт
	
	НоваяСтрокаТБ = ТЧ.Добавить();
	НоваяСтрокаТБ.ВКМ_Договоры = Договор;
	НоваяСтрокаТБ.ВКМ_РеализацияТоваровУслуг = Реализация;
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли