
#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВКМ_ОтпускаСотрудников.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ВКМ_ДатаНачала) И ЗначениеЗаполнено(ТекДанные.ВКМ_ДатаОкончания) Тогда 
		
		ТекДанные.ВКМ_ЧислоДнейОтпуска = (КонецДня(ТекДанные.ВКМ_ДатаОкончания) + 1 - НачалоДня(ТекДанные.ВКМ_ДатаНачала)) / (24 * 3600);
		ОбновитьОтображениеДанных();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Год) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен год");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", ПоместитьДанныеВоВременноеХранилище());
	ПараметрыФормы.Вставить("Год", ПоместитьГодВоВременноеХранилище());
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект); 
	
КонецПроцедуры 



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	Данные = ПоместитьВоВременноеХранилище(Объект.ВКМ_ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);
	Возврат Данные;
КонецФункции

&НаСервере
Функция ПоместитьГодВоВременноеХранилище()
	Год = ПоместитьВоВременноеХранилище(Объект.ВКМ_Год, УникальныйИдентификатор); 
	Возврат Год;
КонецФункции

#КонецОбласти
