
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВыбранныйДоговор = ВыбранДействующийДоговорАбонентскогоОбслуживания();
	Если ВыбранныйДоговор.ВыбранНеверныйДоговор Тогда
		ОбщегоНазначения.СообщитьПользователю(ВыбранныйДоговор.Сообщение);
		Отказ = Истина;
		Возврат;
	КонецЕсли
	
	
	СтоимостьЧаса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_СтоимостьЧасаРаботы")
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	ЧасыКОплатеКлиенту = 0;
	Для Каждого Строка из ВКМ_ВыполненныеРаботы Цикл
		ЧасыКОплатеКлиенту = ЧасыКОплатеКлиенту + Строка.ВКМ_ЧасыКОплатеКлиенту;
	КонецЦикла;
	Движение.ВКМ_КоличествоЧасов = ЧасыКОплатеКлиенту;
	Движение.ВКМ_СуммаКОплате = ЧасыКОплатеКлиенту * СтоимостьЧаса;



КонецПроцедуры



Функция ВыбранДействующийДоговорАбонентскогоОбслуживания()
	
	СтруктураВозврата = Новый Структура();
	СообщениеВозврата = "";
	ВыбранНеверныйДоговор = Ложь;
	
	СтруктураВозврата.Вставить("Сообщение", СообщениеВозврата);
	СтруктураВозврата.Вставить("ВыбранНеверныйДоговор", ВыбранНеверныйДоговор);
	
	ВидДоговораВДокументе = ВКМ_Договор.ВидДоговора;
	АбонентскийДоговор = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание
	
	Если ВидДоговораВДокументе <> АбонентскийДоговор Тогда
		ВыбранНеверныйДоговор = Истина;
		СообщениеВозврата = СообщениеВозврата + "Выбран не абонентский договор";
	КонецЕсли;
	
	Если ВыбранНеверныйДоговор Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	ПериодДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВКМ_Договор, "ВКМ_ДействуетС, ВКМ_ДействуетПо");
	
	ДатаНачалаДействия = ПериодДоговора.ВКМ_ДействуетС;
	ДатаОкончанияДействия = ПериодДоговора.ВКМ_ДействуетПо;
	Если Дата < ДатаНачалаДействия ИЛИ Дата > ДатаОкончанияДоговора Тогда
		СообщениеВозврата = СообщениеВозврата + Символы.ПС + "Выбран недействительный договор";	
	КонецЕсли;

КонецФункции
#КонецЕсли