
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВыбранныйДоговор = ВыбранДействующийДоговорАбонентскогоОбслуживания();
	Если ВыбранныйДоговор.ВыбранНеверныйДоговор Тогда
		ОбщегоНазначения.СообщитьПользователю(ВыбранныйДоговор.Сообщение);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ПроцентОтРабот = ПроцентОтРабот(ВКМ_Специалист);
    Если ПроцентОтРабот = Неопределено Тогда 
		ОбщегоНазначения.СообщитьПользователю("Специалисту не установлен процент от работ");
		Отказ = Истина; 
		Возврат;
	КонецЕсли;

	
	СтоимостьЧаса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_СтоимостьЧасаРаботы");
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	ЧасыКОплатеКлиенту = 0;
	Для Каждого Строка из ВКМ_ВыполненныеРаботы Цикл
		ЧасыКОплатеКлиенту = ЧасыКОплатеКлиенту + Строка.ВКМ_ЧасыКОплатеКлиенту;
	КонецЦикла;
	Движение.ВКМ_КоличествоЧасов = ЧасыКОплатеКлиенту;
	Движение.ВКМ_СуммаКОплате = ЧасыКОплатеКлиенту * СтоимостьЧаса;


	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Сотрудник = ВКМ_Специалист;
	Движение.ВКМ_ЧасовКОплате = ЧасыКОплатеКлиенту;
	Движение.ВКМ_СуммаКОплате = ЧасыКОплатеКлиенту * СтоимостьЧаса * ПроцентОтРабот / 100;
КонецПроцедуры



Функция ВыбранДействующийДоговорАбонентскогоОбслуживания()
	
	СтруктураВозврата = Новый Структура();
	СообщениеВозврата = "";
	ВыбранНеверныйДоговор = Ложь;
	
	СтруктураВозврата.Вставить("Сообщение", СообщениеВозврата);
	СтруктураВозврата.Вставить("ВыбранНеверныйДоговор", ВыбранНеверныйДоговор);
	
	ВидДоговораВДокументе = ВКМ_Договор.ВидДоговора;
	АбонентскийДоговор = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	
	Если ВидДоговораВДокументе <> АбонентскийДоговор Тогда
		ВыбранНеверныйДоговор = Истина;
		СообщениеВозврата = СообщениеВозврата + "Выбран не абонентский договор";
	КонецЕсли;
	
	Если ВыбранНеверныйДоговор Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	ПериодДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВКМ_Договор, "ВКМ_ДействуетС, ВКМ_ДействуетПо");
	
	ДатаНачалаДействия = ПериодДоговора.ВКМ_ДействуетС;
	ДатаОкончанияДействия = ПериодДоговора.ВКМ_ДействуетПо;
	Если Дата < ДатаНачалаДействия ИЛИ Дата > ДатаОкончанияДействия Тогда
		СообщениеВозврата = СообщениеВозврата + Символы.ПС + "Выбран недействительный договор";	
	КонецЕсли;
	
	Возврат СтруктураВозврата; 
КонецФункции

Функция ПроцентОтРабот(Сотрудник);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтРабот КАК ВКМ_ПроцентОтРабот
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ВКМ_Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних"; 
	
	Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ВКМ_ПроцентОтРабот;
		
КонецФункции
  	

#КонецЕсли